#include <stdio.h>   //引入标准输入输出库

int main()   //定义主函数
{            //函数开始
    char c1 = 'P', c2, c3 = 'R', c4, c5 = 'O', c6, c7 = 'G', c8, c9 = 'R', c10, c11 = 'A', c12, c13 = 'M', c14;  // // 定义并初始化字符变量，这里使用了字符的ASCII码值进行初始化
    c2 = c1 + 6;
    c4 = c3 + 6;
    c6 = c5 + 6;
    c8 = c7 + 6;
    c10 = c9 + 6;
    c12 = c11 + 6;
    c14 = c13 + 6;  //// 对每个字符进行加密操作，即将每个字符的ASCII码值增加6
    printf("%c %c %c %c %c %c %c", c2, c4, c6, c8, c10, c12, c14);   // // 打印加密后的字符
    return 0;  //函数返回值0，表示程序正常结束
} //函数结束

